#!/usr/bin/env python
# coding=utf-8
#切片的语法[ 起始:结束:步长 ]
#选取的区间属于左闭有开型，即从“开始”位置，到“结束"位的前一位，(不包含结束位本身)
name ='sushenghong'

for a in name:
    print(a)
print('---------------------------')
i=0
while i<6:
    print(name[i])
    i+=1
#取下标0～2的字符
print('---------------------------')
print(name[0:3])
print('---------------------------')
print(name[::3])
print('---------------------------')
print(name[5::])
#切片操作还可以指定第三个参数，第三个参数表示每N个取一个，上面name[::2] 会每两个元素取出一个来，也就是隔一个取一个
print("---------------------------")
print(name[:3:])
